src/test/jmeter/Load-Report/statistics.json
{
  "Read Genre" : {
    "transaction" : "Read Genre",
    "sampleCount" : 195,
    "errorCount" : 120,
    "errorPct" : 61.53846,
    "meanResTime" : 23416.38974358976,
    "medianResTime" : 30099.0,
    "minResTime" : 5.0,
    "maxResTime" : 39909.0,
    "pct1ResTime" : 33250.8,
    "pct2ResTime" : 34511.99999999999,
    "pct3ResTime" : 39896.52,
    "throughput" : 1.5758721846437316,
    "receivedKBytesPerSec" : 111.1763305008041,
    "sentKBytesPerSec" : 0.19544508540015032
  },
  "Delete playlist" : {
    "transaction" : "Delete playlist",
    "sampleCount" : 10,
    "errorCount" : 8,
    "errorPct" : 80.0,
    "meanResTime" : 8931.6,
    "medianResTime" : 14.0,
    "minResTime" : 4.0,
    "maxResTime" : 30093.0,
    "pct1ResTime" : 30039.2,
    "pct2ResTime" : 30093.0,
    "pct3ResTime" : 30093.0,
    "throughput" : 0.19983214100155872,
    "receivedKBytesPerSec" : 0.305914906478558,
    "sentKBytesPerSec" : 0.2486778293733264
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 831,
    "errorCount" : 457,
    "errorPct" : 54.993984,
    "meanResTime" : 20334.746089049353,
    "medianResTime" : 30091.0,
    "minResTime" : 2.0,
    "maxResTime" : 43419.0,
    "pct1ResTime" : 37971.8,
    "pct2ResTime" : 39564.4,
    "pct3ResTime" : 40916.35999999999,
    "throughput" : 6.690821256038648,
    "receivedKBytesPerSec" : 563.8941019399155,
    "sentKBytesPerSec" : 1.3993700306964574
  },
  "Create User" : {
    "transaction" : "Create User",
    "sampleCount" : 48,
    "errorCount" : 5,
    "errorPct" : 10.416667,
    "meanResTime" : 3684.520833333333,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 40690.0,
    "pct1ResTime" : 30040.2,
    "pct2ResTime" : 36667.34999999999,
    "pct3ResTime" : 40690.0,
    "throughput" : 0.42164441321152496,
    "receivedKBytesPerSec" : 0.5730870904339423,
    "sentKBytesPerSec" : 0.11529339423752635
  },
  "Add Track" : {
    "transaction" : "Add Track",
    "sampleCount" : 28,
    "errorCount" : 10,
    "errorPct" : 35.714287,
    "meanResTime" : 8560.07142857143,
    "medianResTime" : 202.5,
    "minResTime" : 10.0,
    "maxResTime" : 38583.0,
    "pct1ResTime" : 33828.90000000001,
    "pct2ResTime" : 37949.85,
    "pct3ResTime" : 38583.0,
    "throughput" : 0.34819374494808186,
    "receivedKBytesPerSec" : 176.3420857815706,
    "sentKBytesPerSec" : 0.3234927796431014
  },
  "Read Playlist" : {
    "transaction" : "Read Playlist",
    "sampleCount" : 55,
    "errorCount" : 10,
    "errorPct" : 18.181818,
    "meanResTime" : 6193.290909090909,
    "medianResTime" : 9.0,
    "minResTime" : 4.0,
    "maxResTime" : 39844.0,
    "pct1ResTime" : 32322.399999999998,
    "pct2ResTime" : 38332.99999999999,
    "pct3ResTime" : 39844.0,
    "throughput" : 0.4826890166308307,
    "receivedKBytesPerSec" : 109.8100286185221,
    "sentKBytesPerSec" : 0.06127887906446093
  },
  "Read Artist" : {
    "transaction" : "Read Artist",
    "sampleCount" : 207,
    "errorCount" : 136,
    "errorPct" : 65.700485,
    "meanResTime" : 24674.275362318833,
    "medianResTime" : 33686.0,
    "minResTime" : 7.0,
    "maxResTime" : 43419.0,
    "pct1ResTime" : 38824.6,
    "pct2ResTime" : 40034.6,
    "pct3ResTime" : 43177.99999999999,
    "throughput" : 1.8164108774054282,
    "receivedKBytesPerSec" : 67.8974485377673,
    "sentKBytesPerSec" : 0.22705135967567852
  },
  "Remove Track" : {
    "transaction" : "Remove Track",
    "sampleCount" : 22,
    "errorCount" : 22,
    "errorPct" : 100.0,
    "meanResTime" : 34441.36363636363,
    "medianResTime" : 36192.0,
    "minResTime" : 4.0,
    "maxResTime" : 43227.0,
    "pct1ResTime" : 40906.0,
    "pct2ResTime" : 42911.7,
    "pct3ResTime" : 43227.0,
    "throughput" : 0.28356362136522995,
    "receivedKBytesPerSec" : 2.8508792687603113,
    "sentKBytesPerSec" : 0.1899277114160136
  },
  "Create Playlist" : {
    "transaction" : "Create Playlist",
    "sampleCount" : 21,
    "errorCount" : 17,
    "errorPct" : 80.95238,
    "meanResTime" : 30697.04761904762,
    "medianResTime" : 30166.0,
    "minResTime" : 4.0,
    "maxResTime" : 36907.0,
    "pct1ResTime" : 36513.8,
    "pct2ResTime" : 36880.1,
    "pct3ResTime" : 36907.0,
    "throughput" : 0.44274841348485167,
    "receivedKBytesPerSec" : 3.570791485262803,
    "sentKBytesPerSec" : 0.3857783214037233
  },
  "Read Albums" : {
    "transaction" : "Read Albums",
    "sampleCount" : 200,
    "errorCount" : 126,
    "errorPct" : 63.0,
    "meanResTime" : 24338.820000000018,
    "medianResTime" : 30154.0,
    "minResTime" : 7.0,
    "maxResTime" : 39942.0,
    "pct1ResTime" : 39535.1,
    "pct2ResTime" : 39766.95,
    "pct3ResTime" : 39893.93,
    "throughput" : 2.2146186980256672,
    "receivedKBytesPerSec" : 236.24708812244629,
    "sentKBytesPerSec" : 0.27466462368091776
  },
  "User Login" : {
    "transaction" : "User Login",
    "sampleCount" : 45,
    "errorCount" : 3,
    "errorPct" : 6.6666665,
    "meanResTime" : 2395.6666666666665,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 37261.0,
    "pct1ResTime" : 1450.799999999995,
    "pct2ResTime" : 34589.59999999998,
    "pct3ResTime" : 37261.0,
    "throughput" : 0.5145444566410537,
    "receivedKBytesPerSec" : 0.4771260869751646,
    "sentKBytesPerSec" : 0.08391496509673435
  }
}