src/test/jmeter/Load-Report/statistics.json
{
  "Read Genre" : {
    "transaction" : "Read Genre",
    "sampleCount" : 404,
    "errorCount" : 6,
    "errorPct" : 1.4851485,
    "meanResTime" : 362114.62128712883,
    "medianResTime" : 462.0,
    "minResTime" : 5.0,
    "maxResTime" : 1.8859598E7,
    "pct1ResTime" : 1432222.0,
    "pct2ResTime" : 2275993.25,
    "pct3ResTime" : 4168203.1499999976,
    "throughput" : 0.016563044461401978,
    "receivedKBytesPerSec" : 0.87965702319105,
    "sentKBytesPerSec" : 0.0020236977039807596
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10414,
    "errorCount" : 208,
    "errorPct" : 1.9973114,
    "meanResTime" : 130025.7197042444,
    "medianResTime" : 38.0,
    "minResTime" : 1.0,
    "maxResTime" : 2.4393984E7,
    "pct1ResTime" : 12921.5,
    "pct2ResTime" : 829177.75,
    "pct3ResTime" : 3043590.900000001,
    "throughput" : 0.42598669362209896,
    "receivedKBytesPerSec" : 24.46881637954322,
    "sentKBytesPerSec" : 0.05234091248975887
  },
  "Read One Genre" : {
    "transaction" : "Read One Genre",
    "sampleCount" : 188,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 289528.0212765957,
    "medianResTime" : 442.5,
    "minResTime" : 2.0,
    "maxResTime" : 2.4312248E7,
    "pct1ResTime" : 690763.8999999984,
    "pct2ResTime" : 1651534.9999999946,
    "pct3ResTime" : 5348827.539999685,
    "throughput" : 0.007700467225848928,
    "receivedKBytesPerSec" : 0.03588538047046005,
    "sentKBytesPerSec" : 9.700783907563592E-4
  },
  "Read Playlist" : {
    "transaction" : "Read Playlist",
    "sampleCount" : 129,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 234611.06201550388,
    "medianResTime" : 465.0,
    "minResTime" : 3.0,
    "maxResTime" : 3961639.0,
    "pct1ResTime" : 1040180.0,
    "pct2ResTime" : 1980794.0,
    "pct3ResTime" : 3867535.8999999966,
    "throughput" : 0.005288292712002941,
    "receivedKBytesPerSec" : 0.10217663213572087,
    "sentKBytesPerSec" : 6.713652857034982E-4
  },
  "Read One Artist" : {
    "transaction" : "Read One Artist",
    "sampleCount" : 2194,
    "errorCount" : 5,
    "errorPct" : 0.22789426,
    "meanResTime" : 42880.8295350957,
    "medianResTime" : 10.0,
    "minResTime" : 1.0,
    "maxResTime" : 2.4393984E7,
    "pct1ResTime" : 243.5,
    "pct2ResTime" : 2801.25,
    "pct3ResTime" : 1070785.7000000128,
    "throughput" : 0.08980437504484591,
    "receivedKBytesPerSec" : 0.8225859322648863,
    "sentKBytesPerSec" : 0.011374963949314804
  },
  "Read One Albums" : {
    "transaction" : "Read One Albums",
    "sampleCount" : 707,
    "errorCount" : 9,
    "errorPct" : 1.2729844,
    "meanResTime" : 288641.84299858555,
    "medianResTime" : 30.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.4373479E7,
    "pct1ResTime" : 901250.0000000001,
    "pct2ResTime" : 1756579.4000000006,
    "pct3ResTime" : 3107969.8399999994,
    "throughput" : 0.028947063068649085,
    "receivedKBytesPerSec" : 0.6825980389710788,
    "sentKBytesPerSec" : 0.003600230193637427
  },
  "Read Artist" : {
    "transaction" : "Read Artist",
    "sampleCount" : 5036,
    "errorCount" : 3,
    "errorPct" : 0.059571087,
    "meanResTime" : 15686.262907069124,
    "medianResTime" : 352.0,
    "minResTime" : 4.0,
    "maxResTime" : 1.596171E7,
    "pct1ResTime" : 8605.5,
    "pct2ResTime" : 12633.649999999967,
    "pct3ResTime" : 62647.04,
    "throughput" : 0.20599855858276264,
    "receivedKBytesPerSec" : 10.999383103651349,
    "sentKBytesPerSec" : 0.02573448037497628
  },
  "Read One Playlist" : {
    "transaction" : "Read One Playlist",
    "sampleCount" : 71,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 733585.5211267606,
    "medianResTime" : 457.0,
    "minResTime" : 3.0,
    "maxResTime" : 2.4350093E7,
    "pct1ResTime" : 1981.7999999999975,
    "pct2ResTime" : 1180452.5999999957,
    "pct3ResTime" : 2.4350093E7,
    "throughput" : 0.002909261009596341,
    "receivedKBytesPerSec" : 0.031672306381816416,
    "sentKBytesPerSec" : 3.750219270182783E-4
  },
  "Read Albums" : {
    "transaction" : "Read Albums",
    "sampleCount" : 1685,
    "errorCount" : 185,
    "errorPct" : 10.979228,
    "meanResTime" : 411790.224332344,
    "medianResTime" : 51.0,
    "minResTime" : 6.0,
    "maxResTime" : 2.4390811E7,
    "pct1ResTime" : 1684421.8000000073,
    "pct2ResTime" : 2411297.199999996,
    "pct3ResTime" : 3773303.5799999847,
    "throughput" : 0.0689712223816815,
    "receivedKBytesPerSec" : 10.925621915059976,
    "sentKBytesPerSec" : 0.007614879603875143
  }
}