src/test/jmeter/Load-Report/statistics.json
{
  "Read Genre" : {
    "transaction" : "Read Genre",
    "sampleCount" : 1347,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.455827765404583,
    "medianResTime" : 9.0,
    "minResTime" : 3.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 19.0,
    "throughput" : 2.358845759156069,
    "receivedKBytesPerSec" : 127.07590459359818,
    "sentKBytesPerSec" : 0.29255215958283276
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10823,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.716806800332616,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 191.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 23.0,
    "throughput" : 18.200010089629544,
    "receivedKBytesPerSec" : 819.8082517141861,
    "sentKBytesPerSec" : 2.2920570705181027
  },
  "Read One Genre" : {
    "transaction" : "Read One Genre",
    "sampleCount" : 1317,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.299164768413066,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 8.0,
    "throughput" : 2.3390296490212306,
    "receivedKBytesPerSec" : 10.900243637821594,
    "sentKBytesPerSec" : 0.29466291476927614
  },
  "Read Playlist" : {
    "transaction" : "Read Playlist",
    "sampleCount" : 1288,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.629658385093169,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 10.0,
    "throughput" : 2.3028291901478957,
    "receivedKBytesPerSec" : 44.49362844441028,
    "sentKBytesPerSec" : 0.2923513620304946
  },
  "Read One Artist" : {
    "transaction" : "Read One Artist",
    "sampleCount" : 1412,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.188385269121814,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 13.0,
    "throughput" : 2.3931676081713453,
    "receivedKBytesPerSec" : 21.95684538942362,
    "sentKBytesPerSec" : 0.30382010650612784
  },
  "Read One Albums" : {
    "transaction" : "Read One Albums",
    "sampleCount" : 1367,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.734455010972935,
    "medianResTime" : 5.0,
    "minResTime" : 2.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 10.319999999999936,
    "throughput" : 2.374756357293994,
    "receivedKBytesPerSec" : 56.64628787428036,
    "sentKBytesPerSec" : 0.29916364266691914
  },
  "Read Artist" : {
    "transaction" : "Read Artist",
    "sampleCount" : 1436,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.490250696378823,
    "medianResTime" : 9.5,
    "minResTime" : 4.0,
    "maxResTime" : 191.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 33.25999999999976,
    "throughput" : 2.429545712173276,
    "receivedKBytesPerSec" : 129.8003777554449,
    "sentKBytesPerSec" : 0.3036932140216595
  },
  "Read One Playlist" : {
    "transaction" : "Read One Playlist",
    "sampleCount" : 1261,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.018239492466289,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 9.0,
    "throughput" : 2.299932333473773,
    "receivedKBytesPerSec" : 25.038716458560177,
    "sentKBytesPerSec" : 0.2964756523618536
  },
  "Read Albums" : {
    "transaction" : "Read Albums",
    "sampleCount" : 1395,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.282437275985659,
    "medianResTime" : 11.0,
    "minResTime" : 5.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 23.0,
    "pct3ResTime" : 25.0,
    "throughput" : 2.4055415399949305,
    "receivedKBytesPerSec" : 427.5074863993139,
    "sentKBytesPerSec" : 0.298343530839215
  }
}